app/views/items/_user_options.html.erb

  <p class="title">User Panel</p>
  <% if @item.bids.count == 0 %>
---
SELECT COUNT(*) FROM "bids" WHERE "bids"."item_id" = ?  [["item_id", 3]]