app/controllers/bids_controller.rb

  def create
    @bid = Bid.new(bid_params)
    if @bid.save
---
INSERT INTO "bids" ("amount", "created_at", "item_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)