app/controllers/items_controller.rb

  def index
    if (params[:search] && params[:category])
      @items = Item.search(params[:search], params[:category]).order("created_at DESC")
    else
      @items = Item.all
    end
    #pagination
    @items = @items.paginate(page: params[:page], per_page: 5)
---
SELECT "categories".* FROM "categories"
SELECT "items".* FROM "items" WHERE (name || description LIKE '%%') ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "items" WHERE (name || description LIKE '%%')

  def show
    @bid = Bid.new
    @bids = Bid.where("item_id = ?", @item.id)
    @bids = @bids.paginate(page: params[:page], per_page: 5)
---
SELECT "bids".* FROM "bids" WHERE (item_id = 15) ORDER BY bids.created_at DESC
SELECT "bids".* FROM "bids" WHERE (item_id = 7) ORDER BY bids.created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "bids" WHERE "bids"."item_id" = ?  [["item_id", 3]]

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("category_id", "created_at", "description", "finish_time", "name", "starting_price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = 17  [["description", "Good Condition"], ["updated_at", Thu, 10 Dec 2015 17:48:16 UTC +00:00]]

    def set_item
      @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "17"]]

    def set_categories
      @categories = Category.all.collect { |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"