app/controllers/users_controller.rb

  def show
    @items = Item.where("user_id = ?", @user.id)
    @bids = Bid.joins("JOIN items ON bids.item_id = items.id")
               .where("bids.user_id = ? AND items.finish_time > ?", @user.id, Time.now)
               .group(:item_id)
    @won_items = Item.find_won_items(@user)

    # paginate stuff
    @items = @items.paginate(page: params[:items_page], per_page: 5)
    @bids = @bids.paginate(page: params[:bids_page], per_page: 5)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", 2]]
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = ? ORDER BY bids.created_at DESC  [["user_id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "items".* FROM "items" WHERE (user_id = 7) ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "bids" WHERE "bids"."item_id" = ?  [["item_id", 11]]
SELECT COUNT(*) FROM "items" WHERE (user_id = 8)
SELECT "bids".* FROM "bids" JOIN items ON bids.item_id = items.id WHERE (bids.user_id = 14 AND items.finish_time > '2015-12-10 04:29:56.342225') GROUP BY item_id ORDER BY bids.created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) AS count_all, item_id AS item_id FROM "bids" JOIN items ON bids.item_id = items.id WHERE (bids.user_id = 8 AND items.finish_time > '2015-12-09 22:39:09.768141') GROUP BY item_id ORDER BY bids.created_at DESC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)